/*
if (умова) {
    // блок коду, який виконається, якщо умова = true
}

*/


if(5 < 6) {
    console.log('this is true')
}
console.log('code is running')

/*

if (умова) {
    блок коду, який виконається якщо умова = true
} else {
    блок коду, який виконається, якщо умова = false
}

*/


if (5 % 2 === 0) {
   console.log('число парне')
} else {
    console.log('число непарне')
}


/*

Запитайте у юзера, скільки йому років, і якщо > 18, виведіть, що він повнолітній, якщо менше - то ще не повнолітній


*/

const userValue = Number(prompt('Скільки тобі років'));

if (userValue >= 18) {
    console.log('Ви повнолітній')
} else {
    console.log('Ви неповнолітній')
}