'use strict';
/*

1. Дано два масиви - [3, 4, 5], [10, 12, 13].
Об'єднати їх разом в один масив

2. Даний масив [1, 2, 3]. Зробіть з нього масив [3, 2, 1].

3. Даний [3, 4, 5]. Додайте йому в кінець елементи 7, 8, 9

4. Даний [3, 4, 5]. Додайте йому на початок елементи 1, 2

5. Даний масив ['aaa', 'bbb', 'ccc']. Виведіть на консоль останній елемент та видаліть його з масива

6. Даний масив ['aaa', 'ddd', 'eee']. Виведіть на консоль перший елемент та видаліть його з масива

7. Даний масив [1, 2, 3, 4, 5, 6, 7, 8, 9]. Запишіть в новий масив елементи з третього по п'ятий (методами масиву, не вручну!)

8. Даний масив [1, 2, 3, 4, 5, 6, 7, 8, 9]. Зробіть з нього масив [1, 4, 5] (методи масиву, не вручну!)

9. За допомогою методу splice зробіть з масива [1, 2, 3, 4, 5] масив [1, 'w', 'tr', 2, 3, 4, 'vvv', 5]

10. Даний масив ['a', 'b', 'c', 'd']. Зробіть з нього рядок 'dcba'.

*/


//8

const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];

arr.splice(1, 2);
arr.splice(3);

//10

const strArr = ['a', 'b', 'c', 'd'].reverse().join('');